# <font color = darkblue size=50px> Open Data Lab

# <font color = darkblue> Government College Kasaragod

## <font color=magenta> Session - 3 Introduction to NumPy and Pandas

### <font color = magenta> Introduction to DataFrames

---

In [1]:
# Importing necessary libraries

import numpy as np
import pandas as pd

### <font color = darkgreen> Creating DataFrames using Dictionary

In [2]:
# create a dictionary

data = {'City' : ['City_1', 'City_2', 'City_3', 'City_4', 'City_5'],
       'HT' : [36, 37, 36, 34, 35],
       'LT' : [23, 22, 21, 23, 24]}

In [3]:
# convert it into a DataFrame

df = pd.DataFrame(data)

In [4]:
df

     City  HT  LT
0  City_1  36  23
1  City_2  37  22
2  City_3  36  21
3  City_4  34  23
4  City_5  35  24

DataFrame is a single-key multiple value pairs

In [5]:
#columns

df.columns

Index(['City', 'HT', 'LT'], dtype='object')

### <font color= green> Columns

In [6]:
df['City']

0    City_1
1    City_2
2    City_3
3    City_4
4    City_5
Name: City, dtype: object

This is an example of a Pandas Series.

In [7]:
df[['LT']]

   LT
0  23
1  22
2  21
3  23
4  24

When using [ ], the result is a Pandas DataFrame

In [8]:
# Extracting multiple columns

df[['City', 'LT']]

     City  LT
0  City_1  23
1  City_2  22
2  City_3  21
3  City_4  23
4  City_5  24

### <font color = green> Locate Row

In [9]:
# loc attribute

df.loc[2]

City    City_3
HT          36
LT          21
Name: 2, dtype: object

This is an example of a Pandas Series.

In [10]:
df.loc[[2]]

     City  HT  LT
2  City_3  36  21

When using [ ], the result is a Pandas DataFrame

In [11]:
# Locating multiple rows

df.loc[[1,3]]

     City  HT  LT
1  City_2  37  22
3  City_4  34  23

### <font color = green> Named Indexes

In [12]:
data1 = {'HT' : [36, 37, 36, 34, 35],
       'LT' : [23, 22, 21, 23, 24]}

df1 = pd.DataFrame(data1, index=['City_1', 'City_2', 'City_3', 'City_4', 'City_5'])
df1

        HT  LT
City_1  36  23
City_2  37  22
City_3  36  21
City_4  34  23
City_5  35  24

In [13]:
# Locating named indexes
df1.loc['City_4']

HT    34
LT    23
Name: City_4, dtype: int64

In [14]:
df1.loc[['City_3', 'City_5']]

        HT  LT
City_3  36  21
City_5  35  24

### <font color = green> Adding a new column

In [15]:
df1['TD'] = df1['HT'] - df1['LT']

In [16]:
df1

        HT  LT  TD
City_1  36  23  13
City_2  37  22  15
City_3  36  21  15
City_4  34  23  11
City_5  35  24  11

In [17]:
df1['WS'] = [9.3, 9.3, 7.4, 11.1, 14.8]

In [18]:
df1

        HT  LT  TD    WS
City_1  36  23  13   9.3
City_2  37  22  15   9.3
City_3  36  21  15   7.4
City_4  34  23  11  11.1
City_5  35  24  11  14.8

### <font color = green> Delete a column

In [19]:
del df1['TD']

In [20]:
df1

        HT  LT    WS
City_1  36  23   9.3
City_2  37  22   9.3
City_3  36  21   7.4
City_4  34  23  11.1
City_5  35  24  14.8

In [21]:
# simply adding a column with all values same
df1['CC'] = 'Normal'

In [22]:
df1

        HT  LT    WS      CC
City_1  36  23   9.3  Normal
City_2  37  22   9.3  Normal
City_3  36  21   7.4  Normal
City_4  34  23  11.1  Normal
City_5  35  24  14.8  Normal

In [23]:
# another way to drop

df1.drop('CC', axis=1)

        HT  LT    WS
City_1  36  23   9.3
City_2  37  22   9.3
City_3  36  21   7.4
City_4  34  23  11.1
City_5  35  24  14.8

In [24]:
df1

        HT  LT    WS      CC
City_1  36  23   9.3  Normal
City_2  37  22   9.3  Normal
City_3  36  21   7.4  Normal
City_4  34  23  11.1  Normal
City_5  35  24  14.8  Normal

In [25]:
df1 = df1.drop('CC', axis=1)

In [26]:
df1

        HT  LT    WS
City_1  36  23   9.3
City_2  37  22   9.3
City_3  36  21   7.4
City_4  34  23  11.1
City_5  35  24  14.8

### <font color = green> Dimention and Size

In [27]:
# ndim func.

In [28]:
#size func.

### <font color = green> Exporting Dataframe

In [29]:
df

     City  HT  LT
0  City_1  36  23
1  City_2  37  22
2  City_3  36  21
3  City_4  34  23
4  City_5  35  24

In [30]:
# exporting to csv

In [34]:
# without index

In [31]:
# exporting to excel

### <font color = green> Loading files into a DataFrame

In [32]:
#from same directory

In [33]:
#from different directory